#include<stdio.h>
int main()
{
    double a,x;
    int b,c;
    printf("请输入您所需要的加油量 油品类型 加油方式\n");
    scanf("%lf %d %d",&a,&b,&c);
   if(b!=0){
        printf("您所支付的金额为");
    if(b==90&&c==1){//当选择90号油品类型和1号加油方式是执行当下程序//
            x=a*5.14;
        printf("%.2lf\n",x-x*0.05);}//输出支出金额//
        else if(b==90&&c==2){//当选择90号油品类型和2号加油方式是执行当下程序//
                x=a*5.14;
            printf("%.2lf\n",x-x*0.02);}//输出支出金额//
    if(b==93&&c==1){//当选择93号油品类型和1号加油方式是执行当下程序//
            x=a*5.54;
        printf("%.2lf\n",x-x*0.05);}//输出支出金额//
        else if(b==93&&c==2){//当选择93号油品类型和2号加油方式是执行当下程序//
                x=a*5.54;
            printf("%.2lf\n",x-x*0.02);}//输出支出金额//
            if(b==97&&c==1){//当选择97号油品类型和1号加油方式是执行当下程序//
            x=a*5.90;
        printf("%.2lf\n",x-x*0.05);}//输出支出金额//
        else if(b==97&&c==2){//当选择97号油品类型和2号加油方式是执行当下程序//
            x=a*5.90;
            printf("%.2lf\n",x-x*0.02);}//输出支出金额//
            if(b==0&&c==1){
            x=a*5.13;
        printf("%.2lf\n",x-x*0.05);}//如果选择1号支付方式可以享受百分之5的优惠//
        else if(b==0&&c==2){
            x=a*5.13;
            printf("%.2lf\n",x-x*0.02);//如果选择2号支付方式可以享受百分之2的优惠//
            }
   }
    return 0;
}
